<?php


$message = [14, 14, 14, 0, 17, 18, 16, 14, 9, 4, 1, 8, 12, 14, 13, 18, 1, 7];
$resultMessages = [31, 8, 2, 9, 20, 20, 1, 17, 27, 13, 13, 12, 2, 5, 17, 31, 8, 13];

for ($i = 0; $i < count($message); $i++) {
    echo $message[$i] ^ $resultMessages[$i];
    echo "<br>";
}
// СЕМИДЕСЯТИМВОЛьНИЛ - кодовое слово

echo "<hr>";

$message = [16, 8, 12, 24, 12, 4, 30, 15, 28, 5, 6, 10, 2, 4, 23, 11, 3, 24];
$codeWord = [ 17, 6, 12, 9, 5, 6, 17, 31, 18, 9, 12, 4, 14, 11, 28, 13, 9, 10,];

for ($i = 0; $i < count($message); $i++) {
    echo $message[$i] ^ $codeWord[$i];
    echo "<br>";
}

// Расшифровка сообщения "РЗМШМГЮПЬДЕКБГЧЛВШ" -- АО|СИБПРОМКОМПЛЕКТ
?>